Repository: alfan2305/envato-update-plugins
Catalog: languages/envato-update-plugins-*.po
Languages: ro_ro

source: Settings
ro_ro: Setari

source: Please enter your Envato Marketplace Username.
ro_ro: Vă rugăm să introduceți numele de utilizator Envato Market.

source: Please enter your Envato Marketplace API Key.
ro_ro: Vă rugăm introduceți cheia API Envato Market.

source: The API "set" is a required parameter.
ro_ro: "item ID"Envato Marketplace este un parametru obligatoriu.

source: The Envato Marketplace "item ID" is a required parameter.
ro_ro: "item ID"Envato Marketplace este un parametru obligatoriu.

source: Invalid request.
ro_ro: Cererea nu este valida.

source: Settings saved.
ro_ro: Setarile au fost salvate.

source: Error saving data.
ro_ro: Setarile nu au putut fi salvate.

source: Please fill in all fields.
ro_ro: Va rugam sa completati toate campurile.

source: User Account Information
ro_ro: Informații cont

source: To obtain your API Key, visit your "My Settings" page on any of the Envato Marketplaces.
ro_ro: Pentru a obține cheia de API, vizitați pagina dvs. "Setările mele" pe oricare dintre site-urile Envato.

source: Marketplace Username
ro_ro: Nume utilizator Marketplace

source: Secret API Key
ro_ro: Cheia secreta

source: Save Settings
ro_ro: Salveaza setarile.

source: User name is required.
ro_ro: Numele de utilizator este obligatoriu.

source: API key is required.
ro_ro: Chea API este obligatorie.
